cases/F18_taylor_green/case/0/p.template
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
// F18 Taylor-Green -- internalField = EXACT kinematic pressure at t = 0 at the
// built mesh's own cell centres, so the first momentum predictor sees the
// consistent pressure gradient.
dimensions      [0 2 -2 0 0 0 0];
internalField   nonuniform List<scalar> __INTERNALFIELD__;
boundaryField
{
    left   { type cyclic; }
    right  { type cyclic; }
    bottom { type cyclic; }
    top    { type cyclic; }
    frontAndBack { type empty; }
}
